app/controllers/playlists_controller.rb

    def index
        render json: Playlist.all
---
SELECT "playlists".* FROM "playlists"

    def show
        selected_playlist = Playlist.find(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]